Revit 2027 API
PointCloudOverrideSettings.Assign Method
 Assigns values of the source settings to this object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	PointCloudOverrideSettings other
)
Public Sub Assign (
	other As PointCloudOverrideSettings
)
public:
void Assign(
	PointCloudOverrideSettings^ other
)
member Assign :
        other : PointCloudOverrideSettings -> unit
Parameters
other PointCloudOverrideSettings
 The source settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace